##Умова
##Відома грошова сума.Розміняти її купюрами 200, 100, 10 і
##монетою 1 грн., якщо це можливо
suma = int(input("Введіть суму: "))
if suma < 10:
    print(suma, " грн розміняли на ", suma, "монет по 1 грн.")
elif suma < 100:
    coop10 = suma // 10
    monets = suma % 10
    print(suma, " грн розміняли на ",coop10, " купюр по 10 грн і ",\
          monets, "монет по 1 грн.")
elif suma < 200:
    coop100 = suma // 100
    coop10 = (suma % 100) // 10
    monets = (suma % 100) % 10
    print(suma, " грн розміняли на ",coop100, " купюр по 100 грн, ",\
          coop10, " купюр  по 10 грн і ", monets, "монет по 1 грн.")
else:
    coop200 = suma // 200
    coop100 = (suma % 200) // 100
    coop10 = ((suma % 200) % 100) // 10
    monets = ((suma % 200) % 100) % 10
    print(suma, " грн розміняли на ", coop200, " купюр по 200 грн, ", \
          coop100, " купюра по 100 грн, ", coop10, " купюр  по 10 грн і ",\
          monets, "монет по 1 грн.")
